In [16]:
%load_ext sql
%sql postgresql://jovyan:si330studentuser@localhost/si330
import pandas as pd
import sqlalchemy

engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')

pd.read_csv('EXAM_DATA_COMPANY.csv').to_sql("company",engine,if_exists='replace')
pd.read_csv('EXAM_DATA_PERSON.csv').to_sql("person",engine,if_exists='replace')
pd.read_csv('EXAM_DATA_TRANSACT.csv').to_sql("transact",engine,if_exists='replace')

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [17]:
import os
cwd = os.getcwd()
cwd

'/home/jovyan/si330-wn2021-resources'

In [18]:
df = pd.read_csv('EXAM_DATA_COMPANY.csv')
persons = pd.read_csv('EXAM_DATA_PERSON.csv')
df.head()

,address,company,market_cap,industry,state,country,country_code,stock_symbol,time_zone
0,74409 La Follette Hill,Botsford-Dooley,$3.32B,Oil Refining/Marketing,NaN,Taiwan,TW,BCO,Asia/Taipei
1,4 Kropf Crossing,"Buckridge, Conroy and Nitzsche",$93.98M,Major Pharmaceuticals,NY,United States,US,CTIC,America/New_York
2,34952 Badeau Street,"Hegmann, Emmerich and O'Connell",$34.63M,Medical/Dental Instruments,NaN,China,CN,MGCD,Asia/Shanghai
3,876 Golf Course Junction,"Littel, Rau and Kuhlman",NaN,Department/Specialty Retail Stores,OAX,Mexico,MX,SHLDW,America/Mexico_City
4,913 Ludington Parkway,Becker-Macejkovic,NaN,NaN,NaN,China,CN,FRCF,Asia/Harbin

In [19]:
def stuff(x): 
    import re
    if pd.isna(x['market_cap']): return 
    result = re.match('\$(\d+\.\d+)([BM])', x['market_cap']) 
    
    amount = float(result.group(1)) 
    multiplier = result.group(2)

    if multiplier == 'M':
        return amount * 1e6
    return amount * 1e9

df['market_cap'] = df.apply(stuff, axis=1)

In [20]:
#Return a dataframe or series of all mid-cap companies (i.e. market capitalization between \$2-10B) 
mid_caps = df[(df['market_cap'] > 2e9) & (df['market_cap'] < 10e9)]

#merge the dataframes together
combined_df = pd.merge(persons, df, on='company', how='right')
#working overseas (those not living in the country where the company is) 
combined_df = combined_df[combined_df['country_code_x'] != combined_df['country_code_y']]
#during the 3rd quarter (Jul-Sep) of 2020. 
combined_df = combined_df.set_index(pd.to_datetime(combined_df['employee_start'])).sort_index()
#along with their total number of employees that started
combined_df['2020-07-01': '2020-10-30'].groupby('company').apply(len).sort_values(ascending=False)

company
Baumbach, Schaden and Robel       13
Hayes, Bechtelar and O'Connell    13
Koepp Inc                          7
Schumm, Deckow and Padberg         7
Terry, Ortiz and Jacobson          6
                                  ..
Rice-Murazik                       1
Renner-Brekke                      1
Kerluke, Langworth and Spinka      1
Kertzmann Inc                      1
Littel, Rau and Kuhlman            1
Length: 130, dtype: int64

In [21]:
%%sql
select column_name, data_type from information_schema.columns where table_name = 'company';

 * postgresql://jovyan:***@localhost/si330
10 rows affected.

[('index', 'bigint'),
 ('address', 'text'),
 ('company', 'text'),
 ('market_cap', 'text'),
 ('industry', 'text'),
 ('state', 'text'),
 ('country', 'text'),
 ('country_code', 'text'),
 ('stock_symbol', 'text'),
 ('time_zone', 'text')]

In [22]:
%%sql
ALTER TABLE person ALTER COLUMN employee_start TYPE timestamp USING employee_start::timestamp

 * postgresql://jovyan:***@localhost/si330
Done.

[]

In [23]:
df.to_sql("company",engine,if_exists='replace')

In [24]:
%%sql
-- Return a dataframe or series of all mid-cap companies (i.e. market capitalization between \$2-10B) 
-- along with their total number of employees that started working overseas 
-- (those not living in the country where the company is) during the 3rd quarter (Jul-Sep) of 2020. 

SELECT count(*) as employees, company.company FROM person RIGHT JOIN company ON company.company = person.company
WHERE market_cap > 2e9 and market_cap < 10e9
AND employee_start BETWEEN '2020-07-01' and '2020-10-01'
AND company.country_code <> person.country_code
GROUP BY company.company
ORDER BY employees desc

 * postgresql://jovyan:***@localhost/si330
24 rows affected.

[(13, "Hayes, Bechtelar and O'Connell"),
 (11, 'Baumbach, Schaden and Robel'),
 (6, 'Gottlieb-Kessler'),
 (5, 'Terry, Ortiz and Jacobson'),
 (4, 'Rogahn, Hettinger and Corwin'),
 (3, 'Schulist-Feeney'),
 (3, 'Donnelly and Sons'),
 (2, 'Reilly, Lind and Frami'),
 (2, 'Lehner, Willms and McClure'),
 (2, 'Weimann-Crist'),
 (2, 'Hickle-Fay'),
 (2, 'Abbott, Rodriguez and Schmitt'),
 (1, 'Wiza LLC'),
 (1, 'Frami, Satterfield and Hintz'),
 (1, 'Franecki Group'),
 (1, 'Hahn Group'),
 (1, 'Kub Inc'),
 (1, 'Lind, Reinger and Hauck'),
 (1, 'Luettgen-Raynor'),
 (1, 'Orn Inc'),
 (1, 'Orn and Sons'),
 (1, 'Reichert, Reilly and Cronin'),
 (1, 'Toy Inc'),
 (1, 'Witting, Berge and Beahan')]

In [27]:
%%sql

SELECT round(market_cap/(employees * 1000)) as value_per_employee from 
(
    SELECT count(*) as employees, max(company.market_cap) as market_cap, company.company FROM person 
    RIGHT JOIN company ON company.company = person.company
    WHERE market_cap > 2e9 and market_cap < 10e9
    AND employee_start BETWEEN '2020-07-01' and '2020-10-01'
    AND company.country_code <> person.country_code
    GROUP BY company.company
    ORDER BY employees desc
) as company_stats
ORDER BY value_per_employee

 * postgresql://jovyan:***@localhost/si330
24 rows affected.

[(217273.0,),
 (276923.0,),
 (631667.0,),
 (760000.0,),
 (883333.0,),
 (1520000.0,),
 (1710000.0,),
 (1775000.0,),
 (1910000.0,),
 (2050000.0,),
 (2350000.0,),
 (2365000.0,),
 (2430000.0,),
 (2435000.0,),
 (2625000.0,),
 (4330000.0,),
 (5090000.0,),
 (5720000.0,),
 (6070000.0,),
 (6690000.0,),
 (7140000.0,),
 (7660000.0,),
 (8390000.0,),
 (9150000.0,)]